{
  "_name_or_path": "bert-base-cased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "allergy",
    "1": "arthritis",
    "2": "bronchial asthma",
    "3": "cervical spondylosis",
    "4": "chicken pox",
    "5": "common cold",
    "6": "dengue",
    "7": "diabetes",
    "8": "drug reaction",
    "9": "fungal infection",
    "10": "gastroesophageal reflux disease",
    "11": "hypertension",
    "12": "impetigo",
    "13": "jaundice",
    "14": "malaria",
    "15": "migraine",
    "16": "peptic ulcer disease",
    "17": "pneumonia",
    "18": "psoriasis",
    "19": "typhoid",
    "20": "urinary tract infection",
    "21": "varicose veins"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "allergy": 0,
    "arthritis": 1,
    "bronchial asthma": 2,
    "cervical spondylosis": 3,
    "chicken pox": 4,
    "common cold": 5,
    "dengue": 6,
    "diabetes": 7,
    "drug reaction": 8,
    "fungal infection": 9,
    "gastroesophageal reflux disease": 10,
    "hypertension": 11,
    "impetigo": 12,
    "jaundice": 13,
    "malaria": 14,
    "migraine": 15,
    "peptic ulcer disease": 16,
    "pneumonia": 17,
    "psoriasis": 18,
    "typhoid": 19,
    "urinary tract infection": 20,
    "varicose veins": 21
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_attentions": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.35.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
